'use strict'

export const ProfessionalEllinika = {
  'title': 'Τίτλος',
  'titleExample': 'π.χ. Μηχανικός Λογισμικού',
  'description': 'Περιγραφή',
  'descriptionExample': 'π.χ. Εφαρμογές με Spring Boot.',
  'company': 'Εταιρεία',
  'companyExample': 'π.χ. DataScouting',
  'location': 'Τοποθεσία',
  'locationExample': 'π.χ. Θεσσαλονίκη, Ελλάδα',
  'startDate': 'Έναρξη',
  'endDate': 'Λήξη',
  'currently': 'Δουλεύω τώρα',
  'actions': 'Ενέργειες',
  'add': {
    'title': 'Προσθήκη επαγγελματικής εμπειρίας',
    'submit': 'Προσθήκη',
  },
  'update': {
    'title': 'Ενημέρωση επαγγελματικής εμπειρίας',
    'submit': 'Ενημέρωση',
  },
  'delete': {
    'title': 'Διαγραφή επαγγελματικής εμπειρίας',
    'body': 'Είστε σίγουρος;',
    'submit': 'Ναι',
    'cancel': 'Όχι',
  },
  'form': {
    'title': {
      'required': 'Πρέπει να βάλετε τίτλο.',
      'length': {
        'min': 'Ο τίτλος πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Ο τίτλος πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'description': {
      'length': {
        'min': 'Η περιγραφή πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Η περιγραφή πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'company': {
      'required': 'Πρέπει να βάλετε εταιρεία.',
      'length': {
        'min': 'Η εταιρεία πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Η εταιρεία πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'location': {
      'required': 'Πρέπει να βάλετε τοποθεσία.',
      'length': {
        'min': 'Η τοποθεσία πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Η τοποθεσία πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'startDate': {
      'required': 'Πρέπει να βάλετε έναρξη.',
    },
  },
}
