'use strict'

export const AboutEllinika = {
  'title': 'Σχετικά με',
  'body': 'Στα πλαίσια αυτής της πτυχιακής, θα υλοποιηθεί μια online πλατφόρμα διαχείρισης βιογραφικού. <br />' +
    'Σε αυτή τη πλατφόρμα θα μπορεί να εγγράφεται ο καθένας, να δημιουργεί ή να ανεβάζει το βιογραφικό του ' +
    'σε μορφή Europass ή αντίστοιχο. <br />' +
    'Ταυτόχρονα θα μπορεί να συγχρονίζει βασικά μέρη του βιογραφικού του με πλατφόρμες όπως linkedin, zotero ' +
    'ή mendely (για δημοσιεύσεις). <br />' +
    'Τέλος αυτή η πλατφόρμα θα εξάγει το βιογραφικό σε διάφορες μορφές, τόσο στατικές ' +
    '(PDF) όσο και online μέσω JSON, HTML κλπ.',
}
