'use strict'

export const AccountEllinika = {
  'title': 'Διαχείριση λογαριασμού',
  'username': 'Όνομα χρήστη',
  'email': 'e-Mail',
  'firstName': 'Όνομα',
  'lastName': 'Επώνυμο',
  'bio': 'Σύντομη περιγραφή',
  'avatar': 'Φωτογραφία Χρήστη (Url)',
  'mobilePhone': 'Κινητό τηλέφωνο',
  'landPhone': 'Σταθερό τηλέφωνο',
  'fax': 'Fax',
  'password': 'Κωδικός πρόσβασης',
  'newPassword': 'Νέος κωδικός πρόσβασης',
  'save': 'Αποθήκευση',
  'success': {
    'title': "Αποθηκεύτηκαν οι αλλαγές.",
    'body': 'Οι αλλαγές σας αποθηκεύτηκαν με επιτυχία.',
  },
  'error': {
    'title': 'Σφάλμα',
    'body': 'Δεν μπορούμε να αποθηκεύσουμε τις αλλαγές, ελέξτε τα δεδομένα και προσπαθήστε ξανά.',
  },
  'form': {
    'firstName': {
      'required': 'Πρέπει να βάλετε όνομα.',
      'length': {
        'min': 'Το όνομα πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Το όνομα πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'lastName': {
      'required': 'Πρέπει να βάλετε επώνυμο.',
      'length': {
        'min': 'Το επώνυμο πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Το επώνυμο πρόσβασης πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'avatar': {
      'length': {
        'min': 'Η φωτογραφία χρήστη (Url) πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Η φωτογραφία χρήστη (Url) πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'mobilePhone': {
      'length': {
        'min': 'Το κινητό τηλέφωνο πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Το κινητό τηλέφωνο πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'landPhone': {
      'length': {
        'min': 'Το σταθερό τηλέφωνο πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Το σταθερό τηλέφωνο πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'fax': {
      'length': {
        'min': 'Το fax πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Το fax πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'currentPassword': {
      'required': 'Πρέπει να βάλετε κωδικό πρόσβασης.',
      'length': {
        'min': 'Ο κωδικός πρόσβασης πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Ο κωδικός πρόσβασης πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'newPassword': {
      'required': 'Πρέπει να βάλετε νέο κωδικό πρόσβασης.',
      'length': {
        'min': 'Ο νέος κωδικός πρόσβασης πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Ο νέος κωδικός πρόσβασης πρέπει να έχει το πολύ {0} χαρακτήρες.',
      }
    },
  },
}
