'use strict'

export const AuthEllinika = {
  'login': 'Σύνδεση',
  'register': 'Εγγραφή',
  'username': 'Όνομα χρήστη',
  'email': 'e-Mail',
  'firstName': 'Όνομα',
  'lastName': 'Επώνυμο',
  'password': 'Κωδικός πρόσβασης',
  'example': {
    'username': 'π.χ. i.kostelidis',
    'email': 'π.χ. i.kostelidis@example.gr',
    'firstName': 'π.χ. Ιορδάνης',
    'lastName': 'π.χ. Κωστελίδης',
    'password': '***************',
  },
  'error': {
    'cant': {
      'title': 'Δεν μπορούμε να σας συνδέσουμε.',
      'body': 'Ελέγξτε τα στοιχεία και προσπαθήστε ξανά.',
    },
  },
  'form': {
    'username': {
      'required': 'Πρέπει να βάλετε όνομα χρήστη',
      'length': {
        'min': 'Το όνομα χρήστη πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Το όνομα χρήστη πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
    'password': {
      'required': 'Πρέπει να βάλετε κωδικό πρόσβασης.',
      'length': {
        'min': 'Ο κωδικός πρόσβασης πρέπει να έχει τουλάχιστον {0} χαρακτήρες.',
        'max': 'Ο κωδικός πρόσβασης πρέπει να έχει το πολύ {0} χαρακτήρες.',
      },
    },
  },
}
